БухЭксп/DataProcessors/CW_ЗаполнениеБюджета_ПроектДТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ЗаполнениеБюджета_ПроектДТ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДТГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДТГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НетарифкаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БрокерскиеУслугиРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПошлинаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СезСпецПошлинаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АнтидемпинговаяПошлинаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроектДТ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПроектыДТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетДТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_РасчетыДТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыСтатейПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыСтатейПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПлановыеСтатьиЗатратИДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПлановыеСтатьиЗатратИДоходов</Name>
			<Comment>Бюджетирование грузоперевозок</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_Грузоперевозки</xr:Item>
				<xr:Item>Catalog.CW_ВариантыБюджетовПоЗаявкам</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтатьиПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыСтатейПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаКурсаДляПроверки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма без НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Comment>Сумма, включая НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоРуб</Name>
					<Comment>Сумма, включая НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСРуб</Name>
					<Comment>Сумма НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРуб</Name>
					<Comment>Сумма без НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаРуб</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКурсаВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПрогноза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКонтрольнаяДата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДнейПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыНаценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРаспределенияСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДСВСебестоимости</Name>
					<Comment>Учитывать НДСВСебестоимости</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ЗаполнениеБюджета_ПроектДТ/Forms/ФормаНастроекЗаполнения/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Аналитика     = ?(Параметры.Свойство("Заказ"), Параметры.Заказ, Параметры.Грузоперевозка);
	ВерсияБюджета = Параметры.ВерсияБюджета;
	Обработка     = Параметры.Обработка;
	
	СтавкаБезНДС = Перечисления.СтавкиНДС.БезНДС;
	Валюта       = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПрочитатьНастройкиНаСервере();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = _БЭ.ОсновнаяОрганизация();
	КонецЕсли;
	
	ЗагрузитьТЧ();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ЗаписатьНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТЧ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ДТГрузоперевозок.ПроектДТ.НомерГТД КАК НомерГТД,
	|	CW_ДТГрузоперевозок.ПроектДТ.Клиент КАК Клиент,
	|	CW_ДТГрузоперевозок.Номенклатура КАК Номенклатура,
	|	CW_ДТГрузоперевозок.ПроектДТ,
	|	CW_ДТГрузоперевозок.РасчетДТ,
	|	CW_ДТГрузоперевозок.ПроектДТ.Импортер КАК Импортер,
	|	CW_ДТГрузоперевозок.ПроектДТ.Валюта КАК Валюта,
	|	CW_ДТГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	|	СУММА(CW_ДТГрузоперевозок.ВсегоРуб) КАК ВсегоРуб,
	|	СУММА(CW_ДТГрузоперевозок.НетарифкаРуб) КАК НетарифкаРуб,
	|	СУММА(CW_ДТГрузоперевозок.БрокерскиеУслугиРуб) КАК БрокерскиеУслугиРуб
	|ПОМЕСТИТЬ ВТ_Грузоперевозки
	|ИЗ
	|	РегистрСведений.CW_ДТГрузоперевозок КАК CW_ДТГрузоперевозок
	|ГДЕ
	|	CW_ДТГрузоперевозок.ПроектДТ.Аналитика = &Аналитика
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДТГрузоперевозок.ПроектДТ.НомерГТД,
	|	CW_ДТГрузоперевозок.ПроектДТ.Валюта,
	|	CW_ДТГрузоперевозок.ПроектДТ.Импортер,
	|	CW_ДТГрузоперевозок.ПроектДТ.Клиент,
	|	CW_ДТГрузоперевозок.Грузоперевозка,
	|	CW_ДТГрузоперевозок.Номенклатура,
	|	CW_ДТГрузоперевозок.РасчетДТ,
	|	CW_ДТГрузоперевозок.ПроектДТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Грузоперевозки.НомерГТД,
	|	ВТ_Грузоперевозки.Клиент,
	|	ВТ_Грузоперевозки.РасчетДТ,
	|	ВТ_Грузоперевозки.ПроектДТ КАК ПроектДТ,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
	|	ВТ_Грузоперевозки.Импортер,
	|	ВТ_Грузоперевозки.Валюта,
	|	ВТ_Грузоперевозки.Грузоперевозка,
	|	СУММА(ВТ_Грузоперевозки.ВсегоРуб) КАК ВсегоРуб,
	|	СУММА(ВТ_Грузоперевозки.НетарифкаРуб) КАК НетарифкаРуб,
	|	ВТ_Грузоперевозки.БрокерскиеУслугиРуб
	|ИЗ
	|	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Грузоперевозки.Валюта,
	|	ВТ_Грузоперевозки.РасчетДТ,
	|	ВТ_Грузоперевозки.НомерГТД,
	|	ВТ_Грузоперевозки.ПроектДТ,
	|	ВТ_Грузоперевозки.Грузоперевозка,
	|	ВТ_Грузоперевозки.Импортер,
	|	ВТ_Грузоперевозки.Клиент,
	|	ВТ_Грузоперевозки.БрокерскиеУслугиРуб
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроектДТ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	КешТаблицаДеклараций.Загрузить(ТЗ);
	
	ТЗ.Свернуть("НомерГТД,Клиент,Импортер,Валюта,ПроектДТ", "ВсегоРуб,НетарифкаРуб");
	
	ТаблицаДеклараций.Загрузить(ТЗ);
	
	Если ТаблицаДеклараций.Количество() = 1 Тогда
		ТаблицаДеклараций[0].Выбрана = Истина;
	КонецЕсли; 
	
//-------------------------------------------------------------------------------------------------------------------
		
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	Если НЕ _ПроверитьНастройки() Тогда
		Возврат;
	КонецЕсли;

	Отказ = Ложь;
	ЗаполнитьВыбранныйПроектНаСервере(Отказ);
	
	//Если НЕ Отказ Тогда
	//	ЗаполнитьСписокСтавокНДСНаСервере();
	//Иначе	
	//	Возврат;
	//КонецЕсли; 
	//
	//Если Не СписокСтавкиНДС.Количество() = 1 Тогда
	//	ПОВ =  Новый ОписаниеОповещения("ПослеВводаЗначенияСтавкиНДС", ЭтотОбъект);
	//	ПоказатьВводЗначения(ПОВ,  СтавкаНДС, "Выберите ставку НДС");
	//Иначе
	//	СтавкаНДС = СписокСтавкиНДС[0].Значение;
	//КонецЕсли; 
	//
	//Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
	//	Отказ = Истина;
	//КонецЕсли; 
	
	Если НЕ Отказ Тогда
		ЗаполнитьБюджетНаСервере();
	КонецЕсли; 
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияСтавкиНДС(ВыбЗнач, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбЗнач = Неопределено Тогда
        СтавкаНДС = ВыбЗнач;
    КонецЕсли;
	
КонецПроцедуры


//-------------------------------------------------------------------------------------------------------------------

&НаСервере
Процедура ЗаполнитьВыбранныйПроектНаСервере(Отказ)
	
	Отбор = Новый Структура("Выбрана", Истина);
	НайденныеСтроки = ТаблицаДеклараций.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Сообщить("Не выбрана таможенная декларация!");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	ВыбранныйПроектДТ = НайденныеСтроки[0].ПроектДТ;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСтавокНДСНаСервере()
	
	Отбор = Новый Структура("ПроектДТ", ВыбранныйПроектДТ);
	ТаблицаСтавок = КешТаблицаДеклараций.Выгрузить(Отбор, "СтавкаНДС");
	ТаблицаСтавок.Свернуть("СтавкаНДС");
	
	Для каждого Стр Из ТаблицаСтавок Цикл
		СписокСтавкиНДС.Добавить(Стр.СтавкаНДС);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБюджетНаСервере()
	
	Отбор = Новый Структура("ПроектДТ", ВыбранныйПроектДТ);
	ТаблицаДляОбхода = КешТаблицаДеклараций.Выгрузить(Отбор); 
	ТаблицаДляОбхода.Свернуть("Грузоперевозка","ВсегоРуб, НетарифкаРуб, БрокерскиеУслугиРуб"); 

	УчитыватьНДСВСебестоимости = CW_Настройки.ПараметрУчетнойПолитики(ТекущаяДата(), Организация, "УчитыватьНДСВСебестоимости");
	
	Для Каждого Стр из ТаблицаДляОбхода Цикл
		
		// Там. платежи
		СтавкаНДСПроцент = _БЭ.ПолучитьСтавкуНДС(СтавкаНДС);
		СуммаВсего = Стр.ВсегоРуб;
		
		Если СуммаВсего = 0 Тогда
			Продолжить;
		КонецЕсли;   
		
		ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(Валюта.Валюта, ТекущаяДата());
		
		СуммаНДС = 0;
		Сумма    = СуммаВсего - СуммаНДС;

		Спр = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
		Спр.Владелец                = Стр.Грузоперевозка;
		Спр.ВидСтатьиПланирования   = Перечисления.CW_ВидыСтатейПланирования.Расходы;
		Спр.Контрагент              = ТамПлатежи_Контрагент;
		Спр.ВерсияБюджета           = ВерсияБюджета;
		Спр.Валюта                  = Валюта;    
		Спр.УчитыватьНДСВСебестоимости = УчитыватьНДСВСебестоимости;    
		
		Спр.Курс					= ДанныеКурса.Курс;   
		Спр.Кратность				= ДанныеКурса.Кратность;   
		
		Спр.Организация             = Организация;
		Спр.Номенклатура            = ТамПлатежи_Номенклатура;
		Спр.ПорядокОтраженияРасходов= Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		Спр.Сумма                   = Сумма;
		Спр.СтавкаНДС               = СтавкаБезНДС;
		Спр.СуммаНДС                = СуммаНДС;
		Спр.СуммаВсего              = СуммаВсего;
		Спр.СуммаРуб                = Сумма;
		Спр.СуммаНДСРуб             = СуммаНДС;		
		Спр.СуммаВсегоРуб           = СуммаВсего;
		
		Попытка
			Спр.Записать();
		Исключение
		КонецПопытки;
		
		// Нетарифка
		Сумма = Стр.НетарифкаРуб;
		
		Если Сумма = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СуммаНДС   = 0;
		СуммаВсего = Сумма + СуммаНДС;
		
		Спр = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
		Спр.Владелец                = Стр.Грузоперевозка;
		Спр.ВидСтатьиПланирования   = Перечисления.CW_ВидыСтатейПланирования.Расходы;
		Спр.Контрагент              = Нетарифка_Контрагент;
		Спр.ВерсияБюджета           = ВерсияБюджета;
		Спр.Валюта                  = Валюта; 
		
		Спр.Курс					= ДанныеКурса.Курс;   
		Спр.Кратность				= ДанныеКурса.Кратность; 
		
		Спр.Организация             = Организация;
		Спр.Номенклатура            = Нетарифка_Номенклатура;
		Спр.ПорядокОтраженияРасходов= Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		Спр.Сумма                   = Сумма;
		Спр.СтавкаНДС               = СтавкаБезНДС;
		Спр.СуммаНДС                = СуммаНДС;
		Спр.СуммаВсего              = СуммаВсего;
		Спр.СуммаРуб                = Сумма;
		Спр.СуммаНДСРуб             = СуммаНДС;		
		Спр.СуммаВсегоРуб           = СуммаВсего;
		
		Попытка
			Спр.Записать();
		Исключение
		КонецПопытки;
		
		// Брокерские услуги
		Сумма = Стр.БрокерскиеУслугиРуб;
		
		Если Сумма = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СуммаНДС   = 0;
		СуммаВсего = Сумма + СуммаНДС;
		
		Спр = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
		Спр.Владелец                = Стр.Грузоперевозка;
		Спр.ВидСтатьиПланирования   = Перечисления.CW_ВидыСтатейПланирования.Расходы;
		Спр.Контрагент              = БрокерскиеУслуги_Контрагент;
		Спр.ВерсияБюджета           = ВерсияБюджета;
		Спр.Валюта                  = Валюта;  
		
		Спр.Курс					= ДанныеКурса.Курс;   
		Спр.Кратность				= ДанныеКурса.Кратность;   

		Спр.Организация             = Организация;
		Спр.Номенклатура            = БрокерскиеУслуги_Номенклатура;
		Спр.ПорядокОтраженияРасходов= Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		Спр.Сумма                   = Сумма;
		Спр.СтавкаНДС               = СтавкаБезНДС;
		Спр.СуммаНДС                = СуммаНДС;
		Спр.СуммаВсего              = СуммаВсего;
		Спр.СуммаРуб                = Сумма;
		Спр.СуммаНДСРуб             = СуммаНДС;		
		Спр.СуммаВсегоРуб           = СуммаВсего;
		
		Попытка
			Спр.Записать();
		Исключение
		КонецПопытки;


	КонецЦикла;	
	
КонецПроцедуры

//-------------------------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ТаблицаДекларацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СнятьВыделение();
	Элемент.ТекущиеДанные.Выбрана = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДекларацийВыбранаПриИзменении(Элемент)
	
	СнятьВыделение();
	
	ТекСтрока = Элементы.ТаблицаДеклараций.ТекущиеДанные;
	ТекСтрока.Выбрана = Истина;

КонецПроцедуры

&НаСервере
Функция ПрочитатьНастройкиНаСервере()
	
	Настройки = _ПО.ПолучитьНастройки(Обработка);
	_сф.ст_ЗаполнитьСвойства(ЭтаФорма, _СписокНастроекСтрокой(), Настройки);
		
КонецФункции

&НаСервере
Функция ЗаписатьНастройкиНаСервере()
	
	Попытка
		Настройки = Новый Структура();
		_сф.ст_ДобавитьСвойства(Настройки, _СписокНастроекСтрокой(), ЭтаФорма);
		_ПО.ЗаписатьНастройки(Обработка, ,Настройки);
	    Возврат(Истина);
	Исключение
	    Возврат(Ложь);
	КонецПопытки; 
	
КонецФункции

&НаСервере
Функция _СписокНастроекСтрокой()
	
	СписокНастроек = "Нетарифка_Номенклатура,
					|Нетарифка_Контрагент,
					|ТамПлатежи_Контрагент,
					|ТамПлатежи_Номенклатура,
					|БрокерскиеУслуги_Контрагент,
					|БрокерскиеУслуги_Номенклатура,
					|Организация";
						
	Возврат(СтрЗаменить(СписокНастроек, Символы.ПС, ""));
	
КонецФункции	

&НаСервере
Функция _ПроверитьНастройки()
	
	Рез = Истина;
	
	Если НЕ ЗначениеЗаполнено(Нетарифка_Номенклатура) Тогда
		Сообщить("В настройках не заполнено значение ""Номенклатура <Нетарифка>""");
		Рез = Ложь;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Нетарифка_Контрагент) Тогда
		Сообщить("В настройках не заполнено значение ""Контрагент <Нетарифка>""");
		Рез = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТамПлатежи_Номенклатура) Тогда
		Сообщить("В настройках не заполнено значение ""Номенклатура <Там. платежи>""");
		Рез = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТамПлатежи_Контрагент) Тогда
		Сообщить("В настройках не заполнено значение ""Контрагент <Там. платежи>""");
		Рез = Ложь;
	КонецЕсли;
		
	Возврат Рез;
	
КонецФункции	

//-------------------------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура СнятьВыделение()
	
	Для Каждого Стр из ТаблицаДеклараций Цикл
		Стр.Выбрана = Ложь;
	КонецЦикла;
	
КонецПроцедуры
